package com.example.Infrastructure.Services.Realty;

import com.example.Domain.Contracts.Realty.RealtyGenerator;
import com.example.Domain.Models.RealtyDto;

import java.math.BigDecimal;
import java.util.*;
import java.util.stream.IntStream;

// генератор рандомных дом-объектов

/**
 * Сервис генерации информации о недвижимости, реализуя {@link RealtyGenerator}
 */
public class RealtyGeneratorService implements RealtyGenerator {

    private static final Random random = new Random();

    @Override
    public Collection<RealtyDto> generate(int count) {

        return IntStream.range(0, count).mapToObj(_ -> generate()).toList();
    }

    /**
     * Сгенерировать модель {@link RealtyDto}
     * @return Заполненная модель {@link RealtyDto}
     */
    private RealtyDto generate(){
        var randomAddress = "г. " + cities[random.nextInt(cities.length)]
                + " " +streets[random.nextInt(streets.length)]
                + " д. " + random.nextInt(1, 300)
                + (random.nextBoolean() ? " кв. " + random.nextInt(1, 100) : "");

        var randomCost = Math.round(random.nextDouble(50_000, 10_000_000) * 100) / 100.0;

        var randomTotalArea = Math.round(random.nextDouble(50_000, 10_000_000) * 100) / 100.0;

        return RealtyDto.RealtyBuilder.create()
                .setAddress(randomAddress)
                .setCost(new BigDecimal(randomCost))
                .setTotalArea(randomTotalArea)
                .build();
    }

    /**
     * Города для генерации.
     */
    private static final String[] cities = {
            "Осташков",
            "Салават",
            "Вуктыл",
            "Нальчик",
            "Каменск-Шахтинский",
            "Ленинск-Кузнецкий",
            "Химки",
            "Магас",
            "Зеленокумск",
            "Гурьевск",
            "Сосновый Бор",
            "Новороссийск",
            "Сергиев Посад",
            "Ртищево",
            "Ижевск",
            "Майкоп",
            "Челябинск",
            "Санкт-Петербург",
            "Калуга",
            "Осташков",
    };

    /**
     * Улицы для генерации.
     */
    private static final String[] streets = {
            "пл. 1905 года",
            "пл. 1-й Пятилетки",
            "пл. 1 Пятилетки",
            "ул. 22-го Партсъезда",
            "ул. 2-я Новосибирская",
            "ул. 3-го Интернационала",
            "ул. 3-й Пятилетки",
            "ул. 40-летия Комсомола",
            "ул. 40 лет Комсомола",
            "ул. 40 лет Октября",
            "ул. 8 Марта",
            "ул. Авангардная",
            "ул. Авиаторов",
            "ул. Авиационная",
            "ул. Автомагистральная",
            "пер. Автоматики",
            "пер. Автомобильный",
            "ул. Автономных Республик",
            "ул. Агатовая",
            "ул. Агатовая (Торфяник)",
            "ул. Аграрная",
            "ул. Агрономическая",
            "ул. Адмирала Ушакова",
            "ул. Адмирала Ушакова (Рудный)",
            "ул. Азина",
            "ул. Айвазовского",
            "ул. Академика Бардина",
            "ул. Академика Вонсовского",
            "ул. Академика Губкина",
            "ул. Академика Постовского",
            "ул. Академика Сахарова",
            "бульв. Академика Семихатова",
            "ул. Академика Шварца",
            "ул. Академическая",
            "ул. Аквамариновая",
            "ул. Аквамариновая (Торфяник)",
            "ул. Аксакова",
            "ул. Акулова",
            "ул. Александровская",
            "пер. Алма-Атинский",
            "ул. Алтайская",
            "ул. Альпинистов",
            "ул. Амбулаторная",
            "ул. Амбулаторная (Рудный)",
            "ул. Амундсена",
            "ул. Амурская",
            "ул. Анатолия Мехренцева",
            "ул. Анатолия Муранова",
            "ул. Ангарская",
            "ул. Анри Барбюса",
            "ул. Антона Валека",
            "ул. Аппаратная",
            "ул. Апрельская",
            "ул. Апрельская (Кольцово)",
            "ул. Аптекарская",
            "тракт Арамильский",
            "пер. Арамильский",
            "тракт Арамильский 21-й км",
            "ул. Армавирская",
            "ул. Артема",
            "ул. Артиллеристов",
            "ул. Артинская",
            "пер. Асбестовский",
            "ул. Астраханская",
            "ул. Атмосферная (Кольцово)",
            "ул. Бабушкина",
            "ул. Бажова",
            "ул. Базальтовая",
            "пер. Базовый",
            "ул. Байдукова",
            "ул. Байкальская",
            "ул. Бакинских Комиссаров",
            "пер. Банковский",
            "ул. Банникова",
            "ул. Барвинка",
            "ул. Баррикадная",
            "ул. Бархотская",
            "ул. Барьерная",
            "ул. Баумана",
            "пл. Бахчиванджи",
            "ул. Бахчиванджи",
            "ул. Бахчиванджи (Кольцово)",
            "пл. Бахчиванджи (Кольцово)",
            "ул. Бебеля",
            "ул. Белинского",
            "ул. Белореченская",
            "ул. Белоярская",
            "ул. Береговая (пос. Большой Исток)",
            "ул. Берегового",
            "ул. Бережная",
            "ул. Березовая",
            "ул. Березовская",
            "тракт Березовский",
            "ул. Бетонщиков",
            "ул. Бехтерева",
            "ул. Библиотечная",
            "ул. Билимбаевская",
            "ул. Бисертская",
            "ул. Благодатская",
            "ул. Блюхера",
    };
}




